Revit 2027 API
PipingSystem.GetVolume Method
 Gets the volume of this piping system.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetVolume()
Public Function GetVolume As Double
public:
double GetVolume()
member GetVolume : unit -> float
Return Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  The volume can not be calculated for this system.
Remarks
 The publicly exposed method.
See Also
Reference
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace